Repository: nogringo/mailstr
Catalog: lib/l10n/app_*.arb
Languages: es, fr

source: Hello World!
es: ¡Hola Mundo!
fr: Bonjour monde

source: Email locked
es: Email bloqueado
fr: Email verrouillé

source: Email unlocked
es: Email desbloqueado
fr: Email déverrouillé

source: Email Successfully Unlocked!
es: ¡Email desbloqueado con éxito!
fr: Email déverrouillé avec succès !

source: Unlock with Proof Of Work
es: Desbloquear con Prueba de Trabajo
fr: Débloquer avec une Preuve de Travail

# proofOfWorkDescription
source: It's like mining Bitcoin ! Your device will search a code, it will take several minutes and once found your email will be unlocked.
es: ¡Es como minar Bitcoin! Tu dispositivo buscará un código, tomará varios minutos y una vez encontrado tu email será desbloqueado.
fr: C'est comme miner du Bitcoin ! Votre appareil cherchera un code, cela prendra plusieurs minutes et une fois trouvé, votre email sera déverrouillé.

source: Start Proof Of Work
es: Iniciar Prueba de Trabajo
fr: Démarrer la Preuve de Travail

source: Resume Proof Of Work
es: Reanudar Prueba de Trabajo
fr: Reprendre la Preuve de Travail

source: Pause Proof Of Work
es: Pausar Prueba de Trabajo
fr: Mettre en pause la Preuve de Travail

source: Searching for code...
es: Buscando código...
fr: Recherche du code...

source: Proof of Work Completed
es: Prueba de Trabajo completada
fr: Preuve de Travail terminée

# unlockWithCashu
source: Pay with Cashu
es: Desbloquear con Cashu
fr: Débloquer avec Cashu

# cashuDescription
source: Cashu is electronic cash for payments online and around the world. It's Fast, Private, Simple and Secure.
es: Cashu es dinero electrónico para pagos en línea y alrededor del mundo. Es Rápido, Privado, Simple y Seguro.
fr: Cashu est de l'argent électronique pour les paiements en ligne et dans le monde entier. C'est Rapide, Privé, Simple et Sécurisé.

# pasteCashuTokenHint
source: Paste a Cashu token worth {amount} sat{plural} to unlock
es: Pega un token Cashu de {amount} sat{plural} para desbloquear
fr: Collez un jeton Cashu d'une valeur de {amount} sat{plural} pour déverrouiller

source: Submit Payment
es: Enviar Pago
fr: Soumettre le paiement

source: Error
fr: Erreur

# pleasePasteCashuToken
source: Please paste a Cashu token
es: Por favor pega un token Cashu
fr: Veuillez coller un jeton Cashu

source: Create
es: Crear
fr: Créer

source: Unlock now
es: Desbloquear ahora
fr: Débloquer maintenant

source: New email
es: Nuevo email
fr: Nouvel email

source: Copy nsec
es: Copiar nsec
fr: Copier le nsec

source: Nostr based Email service
es: Servicio de email basado en Nostr
fr: Service d'email basé sur Nostr

# createSecureEmailAddresses
source: Create secure email addresses using Nostr keys.
es: Crea direcciones de email seguras usando llaves Nostr.
fr: Créez des adresses email sécurisées en utilisant les clés Nostr.

source: Why {appTitle}?
es: ¿Por qué {appTitle}?
fr: Pourquoi {appTitle} ?

# whyAppTitleDescription
source: Traditional email providers control your data and can shut down your account at any time. {appTitle} is different. Built on the Nostr protocol, your email address is generated from cryptographic keys only you control - no one can revoke your identity. You will never be asked to verify personal information here because we believe anyone should have access to e-mail without requiring to connect it to the growing surveillance state. Our work here is in service to this idea. Lots of services are free because they feast on your personal data for profit or control.
es: Los proveedores de email tradicionales controlan tus datos y pueden cerrar tu cuenta en cualquier momento. {appTitle} es diferente. Basado en el protocolo Nostr, tu dirección de email se genera a partir de llaves criptográficas que solo tú controlas - nadie puede revocar tu identidad. Nunca se te pedirá verificar información personal aquí porque creemos que cualquiera debería tener acceso al email sin requerir conectarlo al creciente estado de vigilancia. Nuestro trabajo aquí está al servicio de esta idea. Muchos servicios son gratuitos porque se alimentan de tus datos personales para beneficio o control.
fr: Les fournisseurs d'email traditionnels contrôlent vos données et peuvent fermer votre compte à tout moment. {appTitle} est différent. Basé sur le protocole Nostr, votre adresse email est générée à partir de clés cryptographiques que vous seul contrôlez - personne ne peut révoquer votre identité. On ne vous demandera jamais de vérifier des informations personnelles car nous pensons que tout le monde devrait avoir accès aux emails sans devoir se connecter à l'état de surveillance croissant. Notre travail ici est au service de cette idée. Beaucoup de services sont gratuits car ils se nourrissent de vos données personnelles pour le profit ou le contrôle.

source: How can I trust you?
es: ¿Cómo puedo confiar en ti?
fr: Comment puis-je vous faire confiance ?

# trustDescription
source: {appTitle} doesn't read or scan your e-mail content in any way, but it's possible for any e-mail provider to read your e-mail, so you'll just have to take our word for it. No "encrypted e-mail" provider is preventing this: even if they encrypt incoming mail before storing it, the provider still receives the e-mail in plaintext first, meaning you're only protected if you assume no one was reading or copying the e-mail as it came in.
es: {appTitle} no lee ni escanea el contenido de tu email de ninguna manera, pero es posible para cualquier proveedor de email leer tu email, así que tendrás que confiar en nuestra palabra. Ningún proveedor de "email encriptado" está evitando esto: incluso si encriptan el correo entrante antes de almacenarlo, el proveedor aún recibe el email en texto plano primero, lo que significa que solo estás protegido si asumes que nadie estaba leyendo o copiando el email mientras llegaba.
fr: {appTitle} ne lit ni ne scanne le contenu de vos emails d'aucune manière, mais il est possible pour tout fournisseur d'email de lire vos emails. Aucun fournisseur d'email crypté n'empêche cela : même s'ils chiffrent les emails entrants avant de les stocker, le fournisseur reçoit toujours l'email en texte brut en premier, ce qui signifie que vous n'êtes protégé que si personne ne lisait ou ne copiait l'email à son arrivée.

# noAccounts
source: No Account
es: Sin cuenta
fr: Pas de compte

source: No Logs
es: Sin logs
fr: Pas de logs

source: Just Privacy
es: Solo privacidad
fr: Juste la confidentialité

# createEmailAddressNow
source: Create An Email Address Now
es: Crear una dirección de email ahora
fr: Créer une adresse email maintenant

# takesLessThan30Seconds
source: Takes less than 30 seconds. No registration required.
es: Toma menos de 30 segundos. No requiere registro.
fr: Prend moins de 30 secondes. Aucune inscription requise.

# youCanNowReceiveEmails
source: You can now receive emails at this address.
es: Ahora puedes recibir emails en esta dirección.
fr: Vous pouvez maintenant recevoir des emails à cette adresse.

source: Copied
es: Copiado
fr: Copié

source: Starting Proof of Work...
es: Iniciando Prueba de Trabajo...
fr: Démarrage de la Preuve de Travail...

# resumingProofOfWork
source: Resuming Proof of Work from nonce: {nonce}
es: Reanudando Prueba de Trabajo desde nonce: {nonce}
fr: Reprise de la Preuve de Travail du nonce : {nonce}

# proofOfWorkPaused
source: Proof of Work paused at nonce: {nonce}
es: Prueba de Trabajo pausada en nonce: {nonce}
fr: Preuve de Travail mise en pause au nonce : {nonce}

source: Proof of Work reset
es: Prueba de Trabajo reiniciada
fr: Preuve de Travail réinitialisée

# proofOfWorkCompletedWithNonce
source: Proof of Work completed! Nonce: {nonce}
es: ¡Prueba de Trabajo completada! Nonce: {nonce}
fr: Preuve de Travail terminée ! Nonce : {nonce}

# searchingWithHashRate
source: Searching... Nonce: {nonce} | Hash rate: {hashRate} H/s
es: Buscando... Nonce: {nonce} | Tasa de hash: {hashRate} H/s
fr: Recherche... Nonce : {nonce} | Taux de hachage : {hashRate} H/s

# errorDecodingNpub
source: Error decoding npub: {error}
es: Error decodificando npub: {error}
fr: Erreur lors du décodage npub : {error}

# invalidPubkeyFormat
source: Invalid pubkey format: length={length}, hex={isHex}
es: Formato de llave pública inválido: longitud={length}, hex={isHex}
fr: Format de clé publique invalide : longueur={length}, hex={isHex}

source: Invalid email format
es: Formato de email inválido
fr: Format d'email invalide

source: Success
es: Éxito
fr: Succès

source: Payment accepted, email unlocked!
es: ¡Pago aceptado, email desbloqueado!
fr: Paiement accepté, email déverrouillé !

source: Email unlocked with Proof of Work!
es: ¡Email desbloqueado con Prueba de Trabajo!
fr: Email déverrouillé avec Preuve de Travail !

source: Failed to verify proof of work
es: Error al verificar prueba de trabajo
fr: Échec de la vérification de la preuve de travail

source: Failed to connect to server
es: Error al conectar con el servidor
fr: Échec de la connexion au serveur

# duration
source: Duration: {duration}
es: Duración: {duration}
fr: Durée : {duration}

source: Home
es: Inicio
fr: Accueil

# whereToReadEmails
source: Where to read my emails?
es: ¿Dónde leer mis emails?
fr: Où lire mes emails ?

# whereToReadEmailsDescription
source: Your emails are sent to you via private message on Nostr. You can read them on any Nostr application that supports private messages like:
es: Tus emails te son enviados por mensaje privado en Nostr. Puedes leerlos en cualquier aplicación Nostr que soporte mensajes privados como:
fr: Vos emails vous sont evoyés par message privé sur Nostr. Vous pouvez les lire sur n'importe quelle application Nostr qui supporte les messages privés comme :

# alreadyHaveNostrAccount
source: I already have a Nostr account, can I receive my emails on this account?
es: Ya tengo una cuenta Nostr, ¿puedo recibir mis emails en esta cuenta?
fr: J'ai déjà un compte Nostr, puis-je recevoir mes emails sur ce compte ?

# yesAddDomainToNpub
source: Yes, you just have to add @{domain} at the end of your public key (Npub) and you have your email address.
es: Sí, solo tienes que agregar @{domain} al final de tu clave pública (Npub) y tienes tu dirección de email.
fr: Oui, vous avez juste à ajouter @{domain} à la fin de votre clé publique (Npub) et vous avez votre adresse email.

source: Loading profile...
es: Cargando perfil...
fr: Chargement du profil...

source: Go to Mailbox
es: Ir al buzón
fr: Aller à la boîte mail

source: Appearance
es: Apariencia
fr: Apparence

source: Logout
es: Cerrar sesión
fr: Déconnexion

# logoutConfirmation
source: Are you sure you want to logout?
es: ¿Estás seguro de que quieres cerrar sesión?
fr: Êtes-vous sûr de vouloir vous déconnecter ?

source: Cancel
es: Cancelar
fr: Annuler

source: Theme Mode
es: Modo de tema
fr: Mode de thème

source: Light
es: Claro
fr: Clair

source: Dark
es: Oscuro
fr: Sombre

source: System
es: Sistema
fr: Système

source: Accent Color
es: Color de acento
fr: Couleur d'accent

# defaultColor
source: Default
es: Predeterminado
fr: Par défaut

source: Picture
es: Imagen
fr: Image

source: Banner
fr: Bannière

source: Mailbox
es: Buzón
fr: Boîte mail

source: Login
es: Iniciar sesión
fr: Connexion

source: Create your address
es: Crea tu dirección
fr: Créez votre adresse

source: username
es: nombre de usuario
fr: nom d'utilisateur

source: Private
es: Privado
fr: Privé

source: Hide from public directory
es: Ocultar del directorio público
fr: Masquer du répertoire public

source: Mailstr Login
es: Iniciar sesión en Mailstr
fr: Connexion à Mailstr

source: Login with Nostr
es: Iniciar sesión con Nostr
fr: Se connecter avec Nostr

source: Close
es: Cerrar
fr: Fermer

# copiedToClipboard
source: {label} copied to clipboard
es: {label} copiado al portapapeles
fr: {label} copié dans le presse-papiers

# privateKeyWarning
source: Your private key (Nsec) is the key to read your emails, keep it in a secure place like your password manager.
es: Tu clave privada (Nsec) es la clave para leer tus emails, guárdala en un lugar seguro como tu gestor de contraseñas.
fr: Votre clé privée (Nsec) est la clé pour lire vos emails, conservez la dans un endroit sécurisé comme votre gestionnaire de mot de passe.

# noAccessWithoutNsec
source: Without your Nsec you will not have access to your emails.
es: Sin tu Nsec no tendrás acceso a tus emails.
fr: Sans votre Nsec vous n'aurez pas accès à vos emails.

source: REGISTER
es: REGISTRAR
fr: ENREGISTRER

source: Connect with Nostr
es: Conectar con Nostr
fr: Se connecter avec Nostr

# secureDecentralizedAuth
source: Secure, decentralized authentication
es: Autenticación segura y descentralizada
fr: Authentification sécurisée et décentralisée

source: Signing capability required
es: Capacidad de firma requerida
fr: Capacité de signature requise

# nip05AndPubkeyReadOnly
source: NIP-05 and pubkey login are read-only. Use:
es: Los inicios de sesión NIP-05 y pubkey son solo lectura. Use:
fr: Les connexions NIP-05 et pubkey sont en lecture seule. Utilisez :

# loginMethodsList
source: • Browser extension (Alby, nos2x, etc.) • Generate new keys • Import private key
es: • Extensión del navegador (Alby, nos2x, etc.) • Generar nuevas claves • Importar clave privada
fr: • Extension de navigateur (Alby, nos2x, etc.) • Générer de nouvelles clés • Importer une clé privée

source: Sign in to Access Mailbox
es: Inicia sesión para acceder al buzón
fr: Connectez-vous pour accéder à la boîte mail

# toReceiveAndSendMessages
source: To receive and send encrypted messages, you need to log in with a Nostr account that can sign messages.
es: Para recibir y enviar mensajes encriptados, necesitas iniciar sesión con una cuenta Nostr que pueda firmar mensajes.
fr: Pour recevoir et envoyer des messages chiffrés, vous devez vous connecter avec un compte Nostr qui peut signer des messages.

source: No messages yet
es: No hay mensajes aún
fr: Pas encore de messages

source: No aliases yet
es: No hay alias aún
fr: Pas encore d'alias

# tapPlusToCreateAlias
source: Tap + to create your first alias
es: Toca + para crear tu primer alias
fr: Appuyez sur + pour créer votre premier alias

source: Limited View
es: Vista limitada
fr: Vue limitée

# youCanOnlySeeDefaultAliases
source: You can only see defaults aliases. To view all your aliases, log in with signing capability.
es: Solo puedes ver los alias predeterminados. Para ver todos tus alias, inicia sesión con capacidad de firma.
fr: Vous ne pouvez voir que les alias par défaut. Pour voir tous vos alias, connectez-vous avec une capacité de signature.

source: Tap to copy
es: Toca para copiar
fr: Appuyez pour copier

source: Use this address as my Nostr address
es: Usar esta dirección como mi dirección Nostr
fr: Utiliser cette adresse comme mon adresse Nostr

source: Unregister Alias
es: Desregistrar Alias
fr: Désinscrire l'Alias

# areYouSureUnregister
source: Are you sure you want to unregister
es: ¿Estás seguro de que quieres desregistrar
fr: Êtes-vous sûr de vouloir désinscrire

source: Alias unregistered
es: Alias desregistrado
fr: Alias désinscrit

source: Failed to unregister alias
es: Error al desregistrar alias
fr: Échec de la désinscription de l'alias

source: Unregister
es: Desregistrar
fr: Désinscrire

source: Inbox
es: Bandeja de entrada
fr: Boîte de réception

source: Aliases
es: Alias
fr: Alias

source: Nostr User
es: Usuario Nostr
fr: Utilisateur Nostr

source: Welcome to my Nostr profile
es: Bienvenido a mi perfil Nostr
fr: Bienvenue sur mon profil Nostr

# claimYourNip05
source: Claim your NIP-05 Nostr address now and use it as your email.
fr: Obtenez votre adresse Nostr NIP-05 maintenant et utilisez-la comme votre email.

source: Claim
fr: Obtenir

source: Switch to
fr: Basculer vers

source: theme
fr: thème

source: Free
fr: Gratuit

# freeDescription
source: No charges, no hidden fees
fr: Aucun frais, aucun coût caché

source: No subscription
fr: Pas d'abonnement

# noSubscriptionDescription
source: Use without monthly payments
fr: Utilisez sans paiements mensuels

# noLogsFeature
source: No logs
fr: Pas de journaux

# noLogsDescription
source: Your privacy is protected
fr: Votre vie privée est protégée

source: Unlimited accounts
fr: Comptes illimités

# unlimitedAccountsDescription
source: Create as many as you need
fr: Créez autant que vous en avez besoin

source: Nostr based
fr: Basé sur Nostr

# nostrBasedDescription
source: Built on decentralized protocol
fr: Construit sur un protocole décentralisé

source: Anonymous
fr: Anonyme

# anonymousDescription
source: No personal info required
fr: Aucune information personnelle requise

source: Open source client
fr: Client open source

# openSourceClientDescription
source: Transparent and auditable
fr: Transparent et vérifiable

# whyChooseMailstr
source: Why choose {appTitle}?
fr: Pourquoi choisir {appTitle} ?

# whyChooseMailstrDescription
source: Mailstr is different from other email services. We understand the importance of your emails. That's why we offer a unique service that benefits the user and not surveillance or data collection. We will never ask for your personal information and you can always create and receive 100% anonymous emails. Your email addresses belong to you and will remain active without any subscription. Our commitment is to never delete them.
fr: Mailstr est différent des autres services d'email. Nous connaissons l'importance de vos emails. C'est pourquoi nous proposons un service unique au bénéfice de l'utilisateur et non pas pour la surveillance ou la collecte de données. Nous ne vous demanderons donc jamais vos informations personnelles et vous pourrez toujours créer et recevoir des emails 100% anonymes. Vos adresses emails vous appartiennent et resteront actives sans aucun abonnement. Notre engagement, à nous, est de ne jamais les supprimer.

source: Payment failed
fr: Le paiement a échoué

source: Trusted mints:
fr: Mints de confiance :

source: Please enter a name
fr: Veuillez entrer un nom

source: Please enter a public key
fr: Veuillez entrer une clé publique

# nameCanOnlyContain
source: Name can only contain letters, numbers, hyphens and underscores
fr: Le nom ne peut contenir que des lettres, chiffres, tirets et underscores

source: Invalid npub format
fr: Format npub invalide

# invalidPublicKeyFormat
source: Invalid public key format (use hex or npub)
fr: Format de clé publique invalide (utilisez hex ou npub)

source: NIP-05 registered successfully!
fr: NIP-05 enregistré avec succès !

source: Registration failed
fr: Échec de l'enregistrement

# nameAlreadyTaken
source: Name already taken for this domain
fr: Nom déjà pris pour ce domaine

# networkError
source: Network error: Please check your connection
fr: Erreur réseau : Veuillez vérifier votre connexion

source: Message
es: Mensaje
